#include <stdio.h>

//指针的相关运算 
int main()
{
	int a[5] = {1,2,3};
	int *p = a;
	
	//1当指针指向数组时，指针加减一个整数相当于在数组中向前或者向后移动几个元素，即*(p+4)等于p[4]等于a[4] 
	*(p+4) = 55;
	int i;
	for(i=0;i<5;i++)
	{
		printf("a[%d] = %d\n", i,a[i]);
	}
	
	//2当两个相同类型的指针指向同一个数组时，这两个指针可以比较大小，此时，指向前面元素的指针<指向后面元素的指针  
	int *p1 = &a[1],*p2 = &a[3];
	if(p1<p2)
	{
		printf("p1<p2\n");
	}
	else
	{
		printf("p1>p2\n");
	}
	
	//3当两个相同类型的指针指向同一个数组时，这两个指针可以做减法，结果是两个指针相差多少个元素 
	int num = p2 - p1;
	printf("p1与p2相差%d个元素.\n", num);
	
	//4两个相同类型的指针可以相互赋值（void类型的指针除外）
	int *q = p1;
	printf("&a[1] = %p\n", &a[1]);
	printf("p1 = %p\n", p1);
	printf("q = %p\n", q); 
	
	return 0;
}
